/*********************************************************************************************
* 初始化变量
*********************************************************************************************/
var myZCloudID = "765667409307";                                   // 智云帐号
var myZCloudKey = " BwYABgMBVwAJAwAPYF9bUllARz8";                 // 智云密钥
var myCameraIP = "http://127.0.0.1:28083/Camera:1";             // 摄像头地址
var user = "admin";                                             // 摄像头访问用户名
var pwd = "admin";                                              // 摄像头访问密码
var type = "ZCamera";                                           // 摄像头型号

var cam = new WSNCamera(myZCloudID, myZCloudKey);               // 创建摄像监控服务对象
var switch_cam = 0;                                             // 摄像头开关状态
var online = 0;                                                 // 摄像头在线状态
var myImgId = "img";                                            // 摄像头网页标签
/*********************************************************************************************
* 初始化摄像头，检查摄像头是否在线
*********************************************************************************************/
$(function() {
  cam.setDiv(myImgId);                                          // 设置图像显示的位置

  cam.initCamera(myCameraIP, user, pwd, type);                  // 摄像头初始化  
  cam.checkOnline(function(state) {
    if (state == 1) {
      online = true;
     // console.log("12321312");
      $("#ConnectState_2").text("摄像头连接成功！");

      cam.openVideo();                                            // 打开摄像头并显示
      switch_cam = 1;
      $("#switch").text("关闭监控");
      $("#switch").siblings("button").attr("class", "btn btn-success");
    }
  });
})

/*********************************************************************************************
* 拍照
*********************************************************************************************/
$("#Snapshot").click(function() {
  if (online == 1&&switch_cam == 1) {
    cam.snapshot();
    
  }
})

/*********************************************************************************************
* 打开/关闭摄像头
*********************************************************************************************/
$("#switch").click(function() {
  if (online == 1&&switch_cam == 0) {
    cam.openVideo();                                            // 打开摄像头并显示
    switch_cam = 1;
    $("#switch").text("关闭监控");
    $("#switch").siblings("button").attr("class", "btn btn-success");
  } else {
    $("#switch").text("打开监控");
    $("#switch").siblings("button").attr("class", "btn btn-default");
    cam.closeVideo();                                           // 关闭视频监控
    switch_cam = 0;
  }
})

/*********************************************************************************************
* 控制摄像头向上移动一次
*********************************************************************************************/
$("#ct_up").mousedown(function() {
  if (online == 1&&switch_cam == 1) {
    cam.control("UP");                                          // 向摄像头发送向上移动命令
  }
})

/*********************************************************************************************
* 控制摄像头向下移动一次
*********************************************************************************************/
$("#ct_down").mousedown(function() {
  if (online == 1&&switch_cam == 1) {
    cam.control("DOWN");                                        // 向摄像头发送向下移动命令
  }
})

/*********************************************************************************************
* 控制摄像头向左移动一次
*********************************************************************************************/
$("#ct_left").mousedown(function() {
  if (online == 1&&switch_cam == 1) {
    cam.control("LEFT");                                        // 向摄像头发送向左移动命令
  }
})

/*********************************************************************************************
* 控制摄像头向右移动一次
*********************************************************************************************/
$("#ct_right").mousedown(function() {
  if (online == 1&&switch_cam == 1) {
    cam.control("RIGHT");                                       // 向摄像头发送向右移动命令
  }
})